## PANDAS FOR DATA ANALYSIS

In [1]:
#importing pandas library or package

#pip install pandas 

import pandas as pd

In [64]:
url = r"C:\Users\User 1\Desktop\Ailead\covid2020.csv"

In [65]:
covid = pd.read_csv(url)

In [66]:
cv.isnull().sum()

date          0
county        0
state         0
fips       8266
cases         0
deaths    18761
dtype: int64

## Start Here -- Data Frame

In [ ]:
# your excel table is called a data frame
#anything inside a rows and column is called dataframe

#single column or row is called series

#external packages to work with dataset called pandas, you need install it

In [40]:
# creating a data frame using dictionary (key-value) like typing in excel
d2 = {'col1': [1, 2, 2.5, 4.3, 8, 7], 'col2': [3, 4, 3.5, "nine", 8, 2.8]}

df = pd.DataFrame(data = d2)
df

   col1  col2
0   1.0     3
1   2.0     4
2   2.5   3.5
3   4.3  nine
4   8.0     8
5   7.0   2.8

In [39]:
#correcting the nine issue
df['col2'].replace("nine", 9 ,inplace=True) 
df['col2']

0    3.0
1    4.0
2    3.5
3    9.0
4    8.0
5    2.8
Name: col2, dtype: float64

In [41]:
# Renaming columns of "a dataframe
df.rename(columns = {"col1": "change"}, inplace = True)
df

   change  col2
0     1.0     3
1     2.0     4
2     2.5   3.5
3     4.3  nine
4     8.0     8
5     7.0   2.8

In [32]:
#checking the data type 
df.dtypes

col1    float64
col2     object
dtype: object

### Loading your data set

- The simplest way of looking at a data set is to examine and subset specific rows and columns. We
 can see which type of information is stored in each column, and can start looking for patterns by 
    aggregating descriptive statistics.

In [93]:
#import pandas as pd
pd.set_option("display.max_rows", 10)
pd.set_option("display.max_columns", None)

#r means treat as raw string for windows

url = r"C:\Users\User 1\Desktop\Ailead\gapminder.csv"

#loading the data

df1 = pd.read_csv(url)
df1

          country continent  year  lifeExp       pop  gdp Per cap
0     Afghanistan      Asia  1952   28.801   8425333   779.445314
1     Afghanistan       NaN  1957   30.332   9240934   820.853030
2     Afghanistan      Asia  1962   31.997  10267083   853.100710
3             NaN      Asia  1967   34.020  11537966   836.197138
4             NaN      Asia  1972   36.088  13079460   739.981106
...           ...       ...   ...      ...       ...          ...
1699     Zimbabwe    Africa  1987   62.351   9216418   706.157306
1700     Zimbabwe    Africa  1992   60.377  10704340   693.420786
1701     Zimbabwe    Africa  1997   46.809  11404948   792.449960
1702     Zimbabwe    Africa  2002   39.989  11926563   672.038623
1703     Zimbabwe    Africa  2007   43.487  12311143   469.709298

[1704 rows x 6 columns]

## Explore the data
- Check the first few rows of the data
- Check the dimensions of the data
- Check data types
- check for any missing number
- perform some simple statistics on the data

In [94]:
#getting the column names of the dataset (is called attributes without ())

df1.columns

Index(['country', 'continent', 'year', 'lifeExp', 'pop', 'gdp Per cap'], dtype='object')

In [95]:
# check the first few rows of the data
df1.head()

       country continent  year  lifeExp       pop  gdp Per cap
0  Afghanistan      Asia  1952   28.801   8425333   779.445314
1  Afghanistan       NaN  1957   30.332   9240934   820.853030
2  Afghanistan      Asia  1962   31.997  10267083   853.100710
3          NaN      Asia  1967   34.020  11537966   836.197138
4          NaN      Asia  1972   36.088  13079460   739.981106

In [96]:
# check the last few rows of the data

df1.tail()

       country continent  year  lifeExp       pop  gdp Per cap
1699  Zimbabwe    Africa  1987   62.351   9216418   706.157306
1700  Zimbabwe    Africa  1992   60.377  10704340   693.420786
1701  Zimbabwe    Africa  1997   46.809  11404948   792.449960
1702  Zimbabwe    Africa  2002   39.989  11926563   672.038623
1703  Zimbabwe    Africa  2007   43.487  12311143   469.709298

In [97]:
# check sample number of rows of the data and set random state

df1.sample(7, random_state = 0)

           country continent  year  lifeExp       pop   gdp Per cap
249         Canada  Americas  1997   78.610  30305843  28954.925890
6      Afghanistan      Asia  1982   39.854  12881816    978.011439
217       Cambodia      Asia  1957   41.366   5322536    434.038336
966     Mauritania    Africa  1982   53.599   1622136   1481.150189
1674   Yemen, Rep.      Asia  1982   49.113   9657618   1977.557010
161       Botswana    Africa  1977   59.319    781472   3214.857818
1344  Sierra Leone    Africa  1952   30.331   2143249    879.787736

In [98]:
# check data types - dtypes

df1.dtypes

country         object
continent       object
year             int64
lifeExp        float64
pop              int64
gdp Per cap    float64
dtype: object

In [99]:
# check the columns of the data

df1.columns

Index(['country', 'continent', 'year', 'lifeExp', 'pop', 'gdp Per cap'], dtype='object')

In [100]:
# check for more info

df1.info()

<class 'pandas.core.frame.DataFrame'>
RangeIndex: 1704 entries, 0 to 1703
Data columns (total 6 columns):
 #   Column       Non-Null Count  Dtype
---  ------       --------------  -----
 0   country      1701 non-null   object
 1   continent    1698 non-null   object
 2   year         1704 non-null   int64
 3   lifeExp      1704 non-null   float64
 4   pop          1704 non-null   int64
 5   gdp Per cap  1704 non-null   float64
dtypes: float64(2), int64(2), object(2)
memory usage: 80.0+ KB

In [101]:
#check the shape (dimension)
df1.shape

(1704, 6)

In [102]:
# select a single column

df1["country"]

0       Afghanistan
1       Afghanistan
2       Afghanistan
3               NaN
4               NaN
           ...
1699       Zimbabwe
1700       Zimbabwe
1701       Zimbabwe
1702       Zimbabwe
1703       Zimbabwe
Name: country, Length: 1704, dtype: object

In [103]:
# check the data type for the single column
df1.country

0       Afghanistan
1       Afghanistan
2       Afghanistan
3               NaN
4               NaN
           ...
1699       Zimbabwe
1700       Zimbabwe
1701       Zimbabwe
1702       Zimbabwe
1703       Zimbabwe
Name: country, Length: 1704, dtype: object

In [104]:
# select a single column

df1["gdp Per cap"]

0       779.445314
1       820.853030
2       853.100710
3       836.197138
4       739.981106
           ...
1699    706.157306
1700    693.420786
1701    792.449960
1702    672.038623
1703    469.709298
Name: gdp Per cap, Length: 1704, dtype: float64

In [105]:
# check the unique value of the single column
df1.continent.unique()

array(['Asia', nan, 'Europe', 'Africa', 'Americas', 'Oceania'],
      dtype=object)

In [106]:
#check the number of unique value of the single column

df1.continent.nunique()

5

In [107]:
# check for any missing values

df1.isnull().sum()

country        3
continent      6
year           0
lifeExp        0
pop            0
gdp Per cap    0
dtype: int64

In [113]:
# check for any missing values

df1.isna().sum()

country        3
continent      6
year           0
lifeExp        0
pop            0
gdp Per cap    0
dtype: int64

In [112]:
# perform some simple statistics on the data (describe)
df1.describe()

#25% of the data have a value below

             year      lifeExp           pop    gdp Per cap
count  1704.00000  1704.000000  1.704000e+03    1704.000000
mean   1979.50000    59.474439  2.960121e+07    7215.327081
std      17.26533    12.917107  1.061579e+08    9857.454543
min    1952.00000    23.599000  6.001100e+04     241.165876
25%    1965.75000    48.198000  2.793664e+06    1202.060309
50%    1979.50000    60.712500  7.023596e+06    3531.846988
75%    1993.25000    70.845500  1.958522e+07    9325.462346
max    2007.00000    82.603000  1.318683e+09  113523.132900

The 25th percentile is the value at which 25% of the answers lie below that value, and 75% of the answers lie above that value. 50th Percentile - Also known as the Median

* count - The number of not-empty values.
* mean - The average (mean) value.
* std - The standard deviation.
* min - the minimum value.
* 25% - The 25% percentile*.
* 50% - The 50% percentile*.
* 75% - The 75% percentile*.
* max - the maximum value.

In [115]:
#selecting multiple rows

#explaining series and dataframe again

df1[["year", "gdp Per cap", "pop"]]

      year  gdp Per cap       pop
0     1952   779.445314   8425333
1     1957   820.853030   9240934
2     1962   853.100710  10267083
3     1967   836.197138  11537966
4     1972   739.981106  13079460
...    ...          ...       ...
1699  1987   706.157306   9216418
1700  1992   693.420786  10704340
1701  1997   792.449960  11404948
1702  2002   672.038623  11926563
1703  2007   469.709298  12311143

[1704 rows x 3 columns]

## Subsetting Columns
- If we want to examine multiple columns, we can specify them by name, positions, or ranges.

## Subsetting Columns by Name
- If we want to examine column from our data, we can access the data using square brackets.

In [120]:
# selecting variables in the data


# select some rows of some columns, the first 10

df1[:10][["year", "pop"]]

   year       pop
0  1952   8425333
1  1957   9240934
2  1962  10267083
3  1967  11537966
4  1972  13079460
5  1977  14880372
6  1982  12881816
7  1987  13867957
8  1992  16317921
9  1997  22227415

In [122]:
#selecting from 25th row to 30th row

df1[25:31][["year", "pop"]]

    year       pop
25  1957  10270856
26  1962  11000948
27  1967  12760499
28  1972  14760787
29  1977  17152804
30  1982  20033753

In [123]:
# show the last 5 rows of the selected column

df1[-5:][["year", "pop"]]

      year       pop
1699  1987   9216418
1700  1992  10704340
1701  1997  11404948
1702  2002  11926563
1703  2007  12311143

++++++++++++++

### Subsetting Multiple columns by name
- To specify multiple columns by the column name, we need to pass in a Python list between the square
brackets.

In [16]:
# select multiple columns"

## Subsetting Rows
- Rows can be subset in multiple ways, by row name or row index:
    - $loc$: subset based on row label.
    - $iloc$: subset based on row index or row number.

In [15]:
# view the data again

In [16]:
# get the first row of the original data 


# get the 100th row

## Subsetting Multiple Rows

In [18]:
# select the first, 50th, and 120th rows

## Subsetting Rows by Row Number: $iloc$
- $iloc$ does the same thing as loc but is used to subset by the row index number. In this example,
$iloc$ and $loc$ will behave exactly the same way since the index labels are the row numbers.
However, keep in mind that the index labels do not necessarily have to be row numbers.

In [19]:
# get the 2nd row

In [20]:
# get the last row of the data

In [21]:
# get the first, 10th, and 100th rows